Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_GTM_TOM_3_Phase_Inverter_PWM_2/Libraries/iLLD/TC3xx/Tricore/_Impl/IfxFlash_cfg_TC39xB.c
/**
 * \file IfxFlash_cfg_TC39xB.c
 * \brief FLASH on-chip implementation data
 *
 * \version iLLD_1_20_0
 * \copyright Copyright (c) 2024 Infineon Technologies AG. All rights reserved.
 *
 *
 *
 *                                 IMPORTANT NOTICE
 *
 * Use of this file is subject to the terms of use agreed between (i) you or
 * the company in which ordinary course of business you are acting and (ii)
 * Infineon Technologies AG or its licensees. If and as long as no such terms
 * of use are agreed, use of this file is subject to following:
 *
 * Boost Software License - Version 1.0 - August 17th, 2003
 *
 * Permission is hereby granted, free of charge, to any person or organization
 * obtaining a copy of the software and accompanying documentation covered by
 * this license (the "Software") to use, reproduce, display, distribute,
 * execute, and transmit the Software, and to prepare derivative works of the
 * Software, and to permit third-parties to whom the Software is furnished to
 * do so, all subject to the following:
 *
 * The copyright notices in the Software and this entire statement, including
 * the above license grant, this restriction and the following disclaimer, must
 * be included in all copies of the Software, in whole or in part, and all
 * derivative works of the Software, unless such copies or derivative works are
 * solely in the form of machine-executable object code generated by a source
 * language processor.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE, TITLE AND NON-INFRINGEMENT. IN NO EVENT
 * SHALL THE COPYRIGHT HOLDERS OR ANYONE DISTRIBUTING THE SOFTWARE BE LIABLE
 * FOR ANY DAMAGES OR OTHER LIABILITY, WHETHER IN CONTRACT, TORT OR OTHERWISE,
 * ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER
 * DEALINGS IN THE SOFTWARE.
 *
 *
 */

/******************************************************************************/
/*----------------------------------Includes----------------------------------*/
/******************************************************************************/
#include "Ifx_Cfg.h"
#if defined (__TASKING__)
#pragma warning 508		/* To suppress empty file warning */
#endif
#if defined (__ghs__)
#pragma diag_suppress 96		/* To suppress empty file warning */
#endif
#if defined DEVICE_TC39XB

#include "IfxFlash_cfg_TC39xB.h" 

/******************************************************************************/
/*-----------------------Exported Variables/Constants-------------------------*/
/******************************************************************************/

IFX_CONST IfxFlash_flashSector IfxFlash_dFlashTableCfsLog[IFXFLASH_DFLASH_NUM_CFS_LOG_SECTORS] = {
    {0xaf800000, 0xaf800fff}, //CFS0
    {0xaf801000, 0xaf801fff}, //CFS1
    {0xaf802000, 0xaf802fff}, //CFS2
    {0xaf803000, 0xaf803fff}, //CFS3
    {0xaf804000, 0xaf804fff}, //CFS4
    {0xaf805000, 0xaf805fff}, //CFS5
    {0xaf806000, 0xaf806fff}, //CFS6
    {0xaf807000, 0xaf807fff}, //CFS7
    {0xaf808000, 0xaf808fff}, //CFS8
    {0xaf809000, 0xaf809fff}, //CFS9
    {0xaf80a000, 0xaf80afff}, //CFS10
    {0xaf80b000, 0xaf80bfff}, //CFS11
    {0xaf80c000, 0xaf80cfff}, //CFS12
    {0xaf80d000, 0xaf80dfff}, //CFS13
    {0xaf80e000, 0xaf80efff}, //CFS14
    {0xaf80f000, 0xaf80ffff}, //CFS15
}


;

IFX_CONST IfxFlash_flashSector IfxFlash_dFlashTableEepLog[IFXFLASH_DFLASH_NUM_LOG_SECTORS] = {
    {0xAF000000, 0xAF000FFF},
    {0xAF001000, 0xAF001FFF},
    {0xAF002000, 0xAF002FFF},
    {0xAF003000, 0xAF003FFF},
    {0xAF004000, 0xAF004FFF},
    {0xAF005000, 0xAF005FFF},
    {0xAF006000, 0xAF006FFF},
    {0xAF007000, 0xAF007FFF},
    {0xAF008000, 0xAF008FFF},
    {0xAF009000, 0xAF009FFF},
    {0xAF00A000, 0xAF00AFFF},
    {0xAF00B000, 0xAF00BFFF},
    {0xAF00C000, 0xAF00CFFF},
    {0xAF00D000, 0xAF00DFFF},
    {0xAF00E000, 0xAF00EFFF},
    {0xAF00F000, 0xAF00FFFF},
    {0xAF010000, 0xAF010FFF},
    {0xAF011000, 0xAF011FFF},
    {0xAF012000, 0xAF012FFF},
    {0xAF013000, 0xAF013FFF},
    {0xAF014000, 0xAF014FFF},
    {0xAF015000, 0xAF015FFF},
    {0xAF016000, 0xAF016FFF},
    {0xAF017000, 0xAF017FFF},
    {0xAF018000, 0xAF018FFF},
    {0xAF019000, 0xAF019FFF},
    {0xAF01A000, 0xAF01AFFF},
    {0xAF01B000, 0xAF01BFFF},
    {0xAF01C000, 0xAF01CFFF},
    {0xAF01D000, 0xAF01DFFF},
    {0xAF01E000, 0xAF01EFFF},
    {0xAF01F000, 0xAF01FFFF},
    {0xAF020000, 0xAF020FFF},
    {0xAF021000, 0xAF021FFF},
    {0xAF022000, 0xAF022FFF},
    {0xAF023000, 0xAF023FFF},
    {0xAF024000, 0xAF024FFF},
    {0xAF025000, 0xAF025FFF},
    {0xAF026000, 0xAF026FFF},
    {0xAF027000, 0xAF027FFF},
    {0xAF028000, 0xAF028FFF},
    {0xAF029000, 0xAF029FFF},
    {0xAF02A000, 0xAF02AFFF},
    {0xAF02B000, 0xAF02BFFF},
    {0xAF02C000, 0xAF02CFFF},
    {0xAF02D000, 0xAF02DFFF},
    {0xAF02E000, 0xAF02EFFF},
    {0xAF02F000, 0xAF02FFFF},
    {0xAF030000, 0xAF030FFF},
    {0xAF031000, 0xAF031FFF},
    {0xAF032000, 0xAF032FFF},
    {0xAF033000, 0xAF033FFF},
    {0xAF034000, 0xAF034FFF},
    {0xAF035000, 0xAF035FFF},
    {0xAF036000, 0xAF036FFF},
    {0xAF037000, 0xAF037FFF},
    {0xAF038000, 0xAF038FFF},
    {0xAF039000, 0xAF039FFF},
    {0xAF03A000, 0xAF03AFFF},
    {0xAF03B000, 0xAF03BFFF},
    {0xAF03C000, 0xAF03CFFF},
    {0xAF03D000, 0xAF03DFFF},
    {0xAF03E000, 0xAF03EFFF},
    {0xAF03F000, 0xAF03FFFF},
    {0xAF040000, 0xAF040FFF},
    {0xAF041000, 0xAF041FFF},
    {0xAF042000, 0xAF042FFF},
    {0xAF043000, 0xAF043FFF},
    {0xAF044000, 0xAF044FFF},
    {0xAF045000, 0xAF045FFF},
    {0xAF046000, 0xAF046FFF},
    {0xAF047000, 0xAF047FFF},
    {0xAF048000, 0xAF048FFF},
    {0xAF049000, 0xAF049FFF},
    {0xAF04A000, 0xAF04AFFF},
    {0xAF04B000, 0xAF04BFFF},
    {0xAF04C000, 0xAF04CFFF},
    {0xAF04D000, 0xAF04DFFF},
    {0xAF04E000, 0xAF04EFFF},
    {0xAF04F000, 0xAF04FFFF},
    {0xAF050000, 0xAF050FFF},
    {0xAF051000, 0xAF051FFF},
    {0xAF052000, 0xAF052FFF},
    {0xAF053000, 0xAF053FFF},
    {0xAF054000, 0xAF054FFF},
    {0xAF055000, 0xAF055FFF},
    {0xAF056000, 0xAF056FFF},
    {0xAF057000, 0xAF057FFF},
    {0xAF058000, 0xAF058FFF},
    {0xAF059000, 0xAF059FFF},
    {0xAF05A000, 0xAF05AFFF},
    {0xAF05B000, 0xAF05BFFF},
    {0xAF05C000, 0xAF05CFFF},
    {0xAF05D000, 0xAF05DFFF},
    {0xAF05E000, 0xAF05EFFF},
    {0xAF05F000, 0xAF05FFFF},
    {0xAF060000, 0xAF060FFF},
    {0xAF061000, 0xAF061FFF},
    {0xAF062000, 0xAF062FFF},
    {0xAF063000, 0xAF063FFF},
    {0xAF064000, 0xAF064FFF},
    {0xAF065000, 0xAF065FFF},
    {0xAF066000, 0xAF066FFF},
    {0xAF067000, 0xAF067FFF},
    {0xAF068000, 0xAF068FFF},
    {0xAF069000, 0xAF069FFF},
    {0xAF06A000, 0xAF06AFFF},
    {0xAF06B000, 0xAF06BFFF},
    {0xAF06C000, 0xAF06CFFF},
    {0xAF06D000, 0xAF06DFFF},
    {0xAF06E000, 0xAF06EFFF},
    {0xAF06F000, 0xAF06FFFF},
    {0xAF070000, 0xAF070FFF},
    {0xAF071000, 0xAF071FFF},
    {0xAF072000, 0xAF072FFF},
    {0xAF073000, 0xAF073FFF},
    {0xAF074000, 0xAF074FFF},
    {0xAF075000, 0xAF075FFF},
    {0xAF076000, 0xAF076FFF},
    {0xAF077000, 0xAF077FFF},
    {0xAF078000, 0xAF078FFF},
    {0xAF079000, 0xAF079FFF},
    {0xAF07A000, 0xAF07AFFF},
    {0xAF07B000, 0xAF07BFFF},
    {0xAF07C000, 0xAF07CFFF},
    {0xAF07D000, 0xAF07DFFF},
    {0xAF07E000, 0xAF07EFFF},
    {0xAF07F000, 0xAF07FFFF},
    {0xAF080000, 0xAF080FFF},
    {0xAF081000, 0xAF081FFF},
    {0xAF082000, 0xAF082FFF},
    {0xAF083000, 0xAF083FFF},
    {0xAF084000, 0xAF084FFF},
    {0xAF085000, 0xAF085FFF},
    {0xAF086000, 0xAF086FFF},
    {0xAF087000, 0xAF087FFF},
    {0xAF088000, 0xAF088FFF},
    {0xAF089000, 0xAF089FFF},
    {0xAF08A000, 0xAF08AFFF},
    {0xAF08B000, 0xAF08BFFF},
    {0xAF08C000, 0xAF08CFFF},
    {0xAF08D000, 0xAF08DFFF},
    {0xAF08E000, 0xAF08EFFF},
    {0xAF08F000, 0xAF08FFFF},
    {0xAF090000, 0xAF090FFF},
    {0xAF091000, 0xAF091FFF},
    {0xAF092000, 0xAF092FFF},
    {0xAF093000, 0xAF093FFF},
    {0xAF094000, 0xAF094FFF},
    {0xAF095000, 0xAF095FFF},
    {0xAF096000, 0xAF096FFF},
    {0xAF097000, 0xAF097FFF},
    {0xAF098000, 0xAF098FFF},
    {0xAF099000, 0xAF099FFF},
    {0xAF09A000, 0xAF09AFFF},
    {0xAF09B000, 0xAF09BFFF},
    {0xAF09C000, 0xAF09CFFF},
    {0xAF09D000, 0xAF09DFFF},
    {0xAF09E000, 0xAF09EFFF},
    {0xAF09F000, 0xAF09FFFF},
    {0xAF0A0000, 0xAF0A0FFF},
    {0xAF0A1000, 0xAF0A1FFF},
    {0xAF0A2000, 0xAF0A2FFF},
    {0xAF0A3000, 0xAF0A3FFF},
    {0xAF0A4000, 0xAF0A4FFF},
    {0xAF0A5000, 0xAF0A5FFF},
    {0xAF0A6000, 0xAF0A6FFF},
    {0xAF0A7000, 0xAF0A7FFF},
    {0xAF0A8000, 0xAF0A8FFF},
    {0xAF0A9000, 0xAF0A9FFF},
    {0xAF0AA000, 0xAF0AAFFF},
    {0xAF0AB000, 0xAF0ABFFF},
    {0xAF0AC000, 0xAF0ACFFF},
    {0xAF0AD000, 0xAF0ADFFF},
    {0xAF0AE000, 0xAF0AEFFF},
    {0xAF0AF000, 0xAF0AFFFF},
    {0xAF0B0000, 0xAF0B0FFF},
    {0xAF0B1000, 0xAF0B1FFF},
    {0xAF0B2000, 0xAF0B2FFF},
    {0xAF0B3000, 0xAF0B3FFF},
    {0xAF0B4000, 0xAF0B4FFF},
    {0xAF0B5000, 0xAF0B5FFF},
    {0xAF0B6000, 0xAF0B6FFF},
    {0xAF0B7000, 0xAF0B7FFF},
    {0xAF0B8000, 0xAF0B8FFF},
    {0xAF0B9000, 0xAF0B9FFF},
    {0xAF0BA000, 0xAF0BAFFF},
    {0xAF0BB000, 0xAF0BBFFF},
    {0xAF0BC000, 0xAF0BCFFF},
    {0xAF0BD000, 0xAF0BDFFF},
    {0xAF0BE000, 0xAF0BEFFF},
    {0xAF0BF000, 0xAF0BFFFF},
    {0xAF0C0000, 0xAF0C0FFF},
    {0xAF0C1000, 0xAF0C1FFF},
    {0xAF0C2000, 0xAF0C2FFF},
    {0xAF0C3000, 0xAF0C3FFF},
    {0xAF0C4000, 0xAF0C4FFF},
    {0xAF0C5000, 0xAF0C5FFF},
    {0xAF0C6000, 0xAF0C6FFF},
    {0xAF0C7000, 0xAF0C7FFF},
    {0xAF0C8000, 0xAF0C8FFF},
    {0xAF0C9000, 0xAF0C9FFF},
    {0xAF0CA000, 0xAF0CAFFF},
    {0xAF0CB000, 0xAF0CBFFF},
    {0xAF0CC000, 0xAF0CCFFF},
    {0xAF0CD000, 0xAF0CDFFF},
    {0xAF0CE000, 0xAF0CEFFF},
    {0xAF0CF000, 0xAF0CFFFF},
    {0xAF0D0000, 0xAF0D0FFF},
    {0xAF0D1000, 0xAF0D1FFF},
    {0xAF0D2000, 0xAF0D2FFF},
    {0xAF0D3000, 0xAF0D3FFF},
    {0xAF0D4000, 0xAF0D4FFF},
    {0xAF0D5000, 0xAF0D5FFF},
    {0xAF0D6000, 0xAF0D6FFF},
    {0xAF0D7000, 0xAF0D7FFF},
    {0xAF0D8000, 0xAF0D8FFF},
    {0xAF0D9000, 0xAF0D9FFF},
    {0xAF0DA000, 0xAF0DAFFF},
    {0xAF0DB000, 0xAF0DBFFF},
    {0xAF0DC000, 0xAF0DCFFF},
    {0xAF0DD000, 0xAF0DDFFF},
    {0xAF0DE000, 0xAF0DEFFF},
    {0xAF0DF000, 0xAF0DFFFF},
    {0xAF0E0000, 0xAF0E0FFF},
    {0xAF0E1000, 0xAF0E1FFF},
    {0xAF0E2000, 0xAF0E2FFF},
    {0xAF0E3000, 0xAF0E3FFF},
    {0xAF0E4000, 0xAF0E4FFF},
    {0xAF0E5000, 0xAF0E5FFF},
    {0xAF0E6000, 0xAF0E6FFF},
    {0xAF0E7000, 0xAF0E7FFF},
    {0xAF0E8000, 0xAF0E8FFF},
    {0xAF0E9000, 0xAF0E9FFF},
    {0xAF0EA000, 0xAF0EAFFF},
    {0xAF0EB000, 0xAF0EBFFF},
    {0xAF0EC000, 0xAF0ECFFF},
    {0xAF0ED000, 0xAF0EDFFF},
    {0xAF0EE000, 0xAF0EEFFF},
    {0xAF0EF000, 0xAF0EFFFF},
    {0xAF0F0000, 0xAF0F0FFF},
    {0xAF0F1000, 0xAF0F1FFF},
    {0xAF0F2000, 0xAF0F2FFF},
    {0xAF0F3000, 0xAF0F3FFF},
    {0xAF0F4000, 0xAF0F4FFF},
    {0xAF0F5000, 0xAF0F5FFF},
    {0xAF0F6000, 0xAF0F6FFF},
    {0xAF0F7000, 0xAF0F7FFF},
    {0xAF0F8000, 0xAF0F8FFF},
    {0xAF0F9000, 0xAF0F9FFF},
    {0xAF0FA000, 0xAF0FAFFF},
    {0xAF0FB000, 0xAF0FBFFF},
    {0xAF0FC000, 0xAF0FCFFF},
    {0xAF0FD000, 0xAF0FDFFF},
    {0xAF0FE000, 0xAF0FEFFF},
    {0xAF0FF000, 0xAF0FFFFF},
};

IFX_CONST IfxFlash_flashSector IfxFlash_dFlashTableHsmLog[IFXFLASH_DFLASH_NUM_HSM_LOG_SECTORS] = {
    {0xAFC00000, 0xAFC00FFF},   //HSM0
    {0xAFC01000, 0xAFC01FFF},   //HSM1
    {0xAFC02000, 0xAFC02FFF},   //HSM2
    {0xAFC03000, 0xAFC03FFF},   //HSM3
    {0xAFC04000, 0xAFC04FFF},   //HSM4
    {0xAFC05000, 0xAFC05FFF},   //HSM5
    {0xAFC06000, 0xAFC06FFF},   //HSM6
    {0xAFC07000, 0xAFC07FFF},   //HSM7
    {0xAFC08000, 0xAFC08FFF},   //HSM8
    {0xAFC09000, 0xAFC09FFF},   //HSM9
    {0xAFC0A000, 0xAFC0AFFF},   //HSM10
    {0xAFC0B000, 0xAFC0BFFF},   //HSM11
    {0xAFC0C000, 0xAFC0CFFF},   //HSM12
    {0xAFC0D000, 0xAFC0DFFF},   //HSM13
    {0xAFC0E000, 0xAFC0EFFF},   //HSM14
    {0xAFC0F000, 0xAFC0FFFF},   //HSM15
    {0xAFC10000, 0xAFC10FFF},   //HSM16
    {0xAFC11000, 0xAFC11FFF},   //HSM17
    {0xAFC12000, 0xAFC12FFF},   //HSM18
    {0xAFC13000, 0xAFC13FFF},   //HSM19
    {0xAFC14000, 0xAFC14FFF},   //HSM20
    {0xAFC15000, 0xAFC15FFF},   //HSM21
    {0xAFC16000, 0xAFC16FFF},   //HSM22
    {0xAFC17000, 0xAFC17FFF},   //HSM23
    {0xAFC18000, 0xAFC18FFF},   //HSM24
    {0xAFC19000, 0xAFC19FFF},   //HSM25
    {0xAFC1A000, 0xAFC1AFFF},   //HSM26
    {0xAFC1B000, 0xAFC1BFFF},   //HSM27
    {0xAFC1C000, 0xAFC1CFFF},   //HSM28
    {0xAFC1D000, 0xAFC1DFFF},   //HSM29
    {0xAFC1E000, 0xAFC1EFFF},   //HSM30
    {0xAFC1F000, 0xAFC1FFFF},   //HSM31
};

IFX_CONST IfxFlash_flashSector IfxFlash_dFlashTablePhys[IFXFLASH_DFLASH_NUM_PHYSICAL_SECTORS] = {
    {IFXFLASH_DFLASH_START, IFXFLASH_DFLASH_END},
};

IFX_CONST IfxFlash_flashSector IfxFlash_dFlashTableUcbLog[IFXFLASH_DFLASH_NUM_UCB_LOG_SECTORS] = {
    {0xAF400000, 0xAF4001FF},   //UCB0
    {0xAF400200, 0xAF4003FF},   //UCB1
    {0xAF400400, 0xAF4005FF},   //UCB2
    {0xAF400600, 0xAF4007FF},   //UCB3
    {0xAF400800, 0xAF4009FF},   //UCB4
    {0xAF400A00, 0xAF400BFF},   //UCB5
    {0xAF400C00, 0xAF400DFF},   //UCB6
    {0xAF400E00, 0xAF400FFF},   //UCB7
    {0xAF401000, 0xAF4011FF},   //UCB8
    {0xAF401200, 0xAF4013FF},   //UCB9
    {0xAF401400, 0xAF4015FF},   //UCB10
    {0xAF401600, 0xAF4017FF},   //UCB11
    {0xAF401800, 0xAF4019FF},   //UCB12
    {0xAF401A00, 0xAF401BFF},   //UCB13
    {0xAF401C00, 0xAF401DFF},   //UCB14
    {0xAF401E00, 0xAF401FFF},   //UCB15
    {0xAF402000, 0xAF4021FF},   //UCB16
    {0xAF402200, 0xAF4023FF},   //UCB17
    {0xAF402400, 0xAF4025FF},   //UCB18
    {0xAF402600, 0xAF4027FF},   //UCB19
    {0xAF402800, 0xAF4029FF},   //UCB20
    {0xAF402A00, 0xAF402BFF},   //UCB21
    {0xAF402C00, 0xAF402DFF},   //UCB22
    {0xAF402E00, 0xAF402FFF},   //UCB23
    {0xAF403000, 0xAF4031FF},   //UCB24
    {0xAF403200, 0xAF4033FF},   //UCB25
    {0xAF403400, 0xAF4035FF},   //UCB26
    {0xAF403600, 0xAF4037FF},   //UCB27
    {0xAF403800, 0xAF4039FF},   //UCB28
    {0xAF403A00, 0xAF403BFF},   //UCB29
    {0xAF403C00, 0xAF403DFF},   //UCB30
    {0xAF403E00, 0xAF403FFF},   //UCB31
    {0xAF404000, 0xAF4041FF},   //UCB32
    {0xAF404200, 0xAF4043FF},   //UCB33
    {0xAF404400, 0xAF4045FF},   //UCB34
    {0xAF404600, 0xAF4047FF},   //UCB35
    {0xAF404800, 0xAF4049FF},   //UCB36
    {0xAF404A00, 0xAF404BFF},   //UCB37
    {0xAF404C00, 0xAF404DFF},   //UCB38
    {0xAF404E00, 0xAF404FFF},   //UCB39
    {0xAF405000, 0xAF4051FF},   //UCB40
    {0xAF405200, 0xAF4053FF},   //UCB41
    {0xAF405400, 0xAF4055FF},   //UCB42
    {0xAF405600, 0xAF4057FF},   //UCB43
    {0xAF405800, 0xAF4059FF},   //UCB44
    {0xAF405A00, 0xAF405BFF},   //UCB45
    {0xAF405C00, 0xAF405DFF},   //UCB46
    {0xAF405E00, 0xAF405FFF},   //UCB47
};

