Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_GTM_TOM_3_Phase_Inverter_PWM_2/Libraries/iLLD/TC3xx/Tricore/_Impl/IfxFlash_cfg_TC39xB.c
    {0xA080C000, 0xA080FFFF},      //	PF2 S131
    {0xA0810000, 0xA0813FFF},      //	PF2 S132
    {0xA0814000, 0xA0817FFF},      //	PF2 S133
    {0xA0818000, 0xA081BFFF},      //	PF2 S134
    {0xA081C000, 0xA081FFFF},      //	PF2 S135
    {0xA0820000, 0xA0823FFF},      //	PF2 S136
    {0xA0824000, 0xA0827FFF},      //	PF2 S137
    {0xA0828000, 0xA082BFFF},      //	PF2 S138
    {0xA082C000, 0xA082FFFF},      //	PF2 S139
    {0xA0830000, 0xA0833FFF},      //	PF2 S140
    {0xA0834000, 0xA0837FFF},      //	PF2 S141
    {0xA0838000, 0xA083BFFF},      //	PF2 S142
    {0xA083C000, 0xA083FFFF},      //	PF2 S143
    {0xA0840000, 0xA0843FFF},      //	PF2 S144
    {0xA0844000, 0xA0847FFF},      //	PF2 S145
    {0xA0848000, 0xA084BFFF},      //	PF2 S146
    {0xA084C000, 0xA084FFFF},      //	PF2 S147
    {0xA0850000, 0xA0853FFF},      //	PF2 S148
    {0xA0854000, 0xA0857FFF},      //	PF2 S149
    {0xA0858000, 0xA085BFFF},      //	PF2 S150
    {0xA085C000, 0xA085FFFF},      //	PF2 S151
    {0xA0860000, 0xA0863FFF},      //	PF2 S152
    {0xA0864000, 0xA0867FFF},      //	PF2 S153
    {0xA0868000, 0xA086BFFF},      //	PF2 S154
    {0xA086C000, 0xA086FFFF},      //	PF2 S155
    {0xA0870000, 0xA0873FFF},      //	PF2 S156
    {0xA0874000, 0xA0877FFF},      //	PF2 S157
    {0xA0878000, 0xA087BFFF},      //	PF2 S158
    {0xA087C000, 0xA087FFFF},      //	PF2 S159
    {0xA0880000, 0xA0883FFF},      //	PF2 S160
    {0xA0884000, 0xA0887FFF},      //	PF2 S161
    {0xA0888000, 0xA088BFFF},      //	PF2 S162
    {0xA088C000, 0xA088FFFF},      //	PF2 S163
    {0xA0890000, 0xA0893FFF},      //	PF2 S164
    {0xA0894000, 0xA0897FFF},      //	PF2 S165
    {0xA0898000, 0xA089BFFF},      //	PF2 S166
    {0xA089C000, 0xA089FFFF},      //	PF2 S167
    {0xA08A0000, 0xA08A3FFF},      //	PF2 S168
    {0xA08A4000, 0xA08A7FFF},      //	PF2 S169
    {0xA08A8000, 0xA08ABFFF},      //	PF2 S170
    {0xA08AC000, 0xA08AFFFF},      //	PF2 S171
    {0xA08B0000, 0xA08B3FFF},      //	PF2 S172
    {0xA08B4000, 0xA08B7FFF},      //	PF2 S173
    {0xA08B8000, 0xA08BBFFF},      //	PF2 S174
    {0xA08BC000, 0xA08BFFFF},      //	PF2 S175
    {0xA08C0000, 0xA08C3FFF},      //	PF2 S176
    {0xA08C4000, 0xA08C7FFF},      //	PF2 S177
    {0xA08C8000, 0xA08CBFFF},      //	PF2 S178
    {0xA08CC000, 0xA08CFFFF},      //	PF2 S179
    {0xA08D0000, 0xA08D3FFF},      //	PF2 S180
    {0xA08D4000, 0xA08D7FFF},      //	PF2 S181
    {0xA08D8000, 0xA08DBFFF},      //	PF2 S182
    {0xA08DC000, 0xA08DFFFF},      //	PF2 S183
    {0xA08E0000, 0xA08E3FFF},      //	PF2 S184
    {0xA08E4000, 0xA08E7FFF},      //	PF2 S185
    {0xA08E8000, 0xA08EBFFF},      //	PF2 S186
    {0xA08EC000, 0xA08EFFFF},      //	PF2 S187
    {0xA08F0000, 0xA08F3FFF},      //	PF2 S188
    {0xA08F4000, 0xA08F7FFF},      //	PF2 S189
    {0xA08F8000, 0xA08FBFFF},      //	PF2 S190
    {0xA08FC000, 0xA08FFFFF},      //	PF2 S191
    {0xA0900000, 0xA0903FFF},      //	PF3 S0
    {0xA0904000, 0xA0907FFF},      //	PF3 S1
    {0xA0908000, 0xA090BFFF},      //	PF3 S2
    {0xA090C000, 0xA090FFFF},      //	PF3 S3
    {0xA0910000, 0xA0913FFF},      //	PF3 S4
    {0xA0914000, 0xA0917FFF},      //	PF3 S5
    {0xA0918000, 0xA091BFFF},      //	PF3 S6
    {0xA091C000, 0xA091FFFF},      //	PF3 S7
    {0xA0920000, 0xA0923FFF},      //	PF3 S8
    {0xA0924000, 0xA0927FFF},      //	PF3 S9
    {0xA0928000, 0xA092BFFF},      //	PF3 S10
    {0xA092C000, 0xA092FFFF},      //	PF3 S11
    {0xA0930000, 0xA0933FFF},      //	PF3 S12
    {0xA0934000, 0xA0937FFF},      //	PF3 S13
    {0xA0938000, 0xA093BFFF},      //	PF3 S14
    {0xA093C000, 0xA093FFFF},      //	PF3 S15
    {0xA0940000, 0xA0943FFF},      //	PF3 S16
    {0xA0944000, 0xA0947FFF},      //	PF3 S17
    {0xA0948000, 0xA094BFFF},      //	PF3 S18
    {0xA094C000, 0xA094FFFF},      //	PF3 S19
    {0xA0950000, 0xA0953FFF},      //	PF3 S20
    {0xA0954000, 0xA0957FFF},      //	PF3 S21
    {0xA0958000, 0xA095BFFF},      //	PF3 S22
    {0xA095C000, 0xA095FFFF},      //	PF3 S23
    {0xA0960000, 0xA0963FFF},      //	PF3 S24
    {0xA0964000, 0xA0967FFF},      //	PF3 S25
    {0xA0968000, 0xA096BFFF},      //	PF3 S26
    {0xA096C000, 0xA096FFFF},      //	PF3 S27
    {0xA0970000, 0xA0973FFF},      //	PF3 S28
    {0xA0974000, 0xA0977FFF},      //	PF3 S29
    {0xA0978000, 0xA097BFFF},      //	PF3 S30
    {0xA097C000, 0xA097FFFF},      //	PF3 S31
    {0xA0980000, 0xA0983FFF},      //	PF3 S32
    {0xA0984000, 0xA0987FFF},      //	PF3 S33
    {0xA0988000, 0xA098BFFF},      //	PF3 S34
    {0xA098C000, 0xA098FFFF},      //	PF3 S35
    {0xA0990000, 0xA0993FFF},      //	PF3 S36
    {0xA0994000, 0xA0997FFF},      //	PF3 S37
    {0xA0998000, 0xA099BFFF},      //	PF3 S38
    {0xA099C000, 0xA099FFFF},      //	PF3 S39
    {0xA09A0000, 0xA09A3FFF},      //	PF3 S40
    {0xA09A4000, 0xA09A7FFF},      //	PF3 S41
    {0xA09A8000, 0xA09ABFFF},      //	PF3 S42
    {0xA09AC000, 0xA09AFFFF},      //	PF3 S43
    {0xA09B0000, 0xA09B3FFF},      //	PF3 S44
    {0xA09B4000, 0xA09B7FFF},      //	PF3 S45
    {0xA09B8000, 0xA09BBFFF},      //	PF3 S46
    {0xA09BC000, 0xA09BFFFF},      //	PF3 S47
    {0xA09C0000, 0xA09C3FFF},      //	PF3 S48
    {0xA09C4000, 0xA09C7FFF},      //	PF3 S49
    {0xA09C8000, 0xA09CBFFF},      //	PF3 S50
    {0xA09CC000, 0xA09CFFFF},      //	PF3 S51
    {0xA09D0000, 0xA09D3FFF},      //	PF3 S52
    {0xA09D4000, 0xA09D7FFF},      //	PF3 S53
    {0xA09D8000, 0xA09DBFFF},      //	PF3 S54
    {0xA09DC000, 0xA09DFFFF},      //	PF3 S55
    {0xA09E0000, 0xA09E3FFF},      //	PF3 S56
    {0xA09E4000, 0xA09E7FFF},      //	PF3 S57
    {0xA09E8000, 0xA09EBFFF},      //	PF3 S58
    {0xA09EC000, 0xA09EFFFF},      //	PF3 S59
    {0xA09F0000, 0xA09F3FFF},      //	PF3 S60
    {0xA09F4000, 0xA09F7FFF},      //	PF3 S61
    {0xA09F8000, 0xA09FBFFF},      //	PF3 S62
    {0xA09FC000, 0xA09FFFFF},      //	PF3 S63

    {0xA0A00000, 0xA0A03FFF},      //	PF3 S64
    {0xA0A04000, 0xA0A07FFF},      //	PF3 S65
    {0xA0A08000, 0xA0A0BFFF},      //	PF3 S66
    {0xA0A0C000, 0xA0A0FFFF},      //	PF3 S67
    {0xA0A10000, 0xA0A13FFF},      //	PF3 S68
    {0xA0A14000, 0xA0A17FFF},      //	PF3 S69
    {0xA0A18000, 0xA0A1BFFF},      //	PF3 S70
    {0xA0A1C000, 0xA0A1FFFF},      //	PF3 S71
    {0xA0A20000, 0xA0A23FFF},      //	PF3 S72
    {0xA0A24000, 0xA0A27FFF},      //	PF3 S73
    {0xA0A28000, 0xA0A2BFFF},      //	PF3 S74
    {0xA0A2C000, 0xA0A2FFFF},      //	PF3 S75
    {0xA0A30000, 0xA0A33FFF},      //	PF3 S76
    {0xA0A34000, 0xA0A37FFF},      //	PF3 S77
    {0xA0A38000, 0xA0A3BFFF},      //	PF3 S78
    {0xA0A3C000, 0xA0A3FFFF},      //	PF3 S79
    {0xA0A40000, 0xA0A43FFF},      //	PF3 S80
    {0xA0A44000, 0xA0A47FFF},      //	PF3 S81
    {0xA0A48000, 0xA0A4BFFF},      //	PF3 S82
    {0xA0A4C000, 0xA0A4FFFF},      //	PF3 S83
    {0xA0A50000, 0xA0A53FFF},      //	PF3 S84
    {0xA0A54000, 0xA0A57FFF},      //	PF3 S85
    {0xA0A58000, 0xA0A5BFFF},      //	PF3 S86
    {0xA0A5C000, 0xA0A5FFFF},      //	PF3 S87
    {0xA0A60000, 0xA0A63FFF},      //	PF3 S88
    {0xA0A64000, 0xA0A67FFF},      //	PF3 S89
    {0xA0A68000, 0xA0A6BFFF},      //	PF3 S90
    {0xA0A6C000, 0xA0A6FFFF},      //	PF3 S91
    {0xA0A70000, 0xA0A73FFF},      //	PF3 S92
    {0xA0A74000, 0xA0A77FFF},      //	PF3 S93
    {0xA0A78000, 0xA0A7BFFF},      //	PF3 S94
    {0xA0A7C000, 0xA0A7FFFF},      //	PF3 S95
    {0xA0A80000, 0xA0A83FFF},      //	PF3 S96
    {0xA0A84000, 0xA0A87FFF},      //	PF3 S97
    {0xA0A88000, 0xA0A8BFFF},      //	PF3 S98
    {0xA0A8C000, 0xA0A8FFFF},      //	PF3 S99
    {0xA0A90000, 0xA0A93FFF},      //	PF3 S100
    {0xA0A94000, 0xA0A97FFF},      //	PF3 S101
    {0xA0A98000, 0xA0A9BFFF},      //	PF3 S102
    {0xA0A9C000, 0xA0A9FFFF},      //	PF3 S103
    {0xA0AA0000, 0xA0AA3FFF},      //	PF3 S104
    {0xA0AA4000, 0xA0AA7FFF},      //	PF3 S105
    {0xA0AA8000, 0xA0AABFFF},      //	PF3 S106
    {0xA0AAC000, 0xA0AAFFFF},      //	PF3 S107
    {0xA0AB0000, 0xA0AB3FFF},      //	PF3 S108
    {0xA0AB4000, 0xA0AB7FFF},      //	PF3 S109
    {0xA0AB8000, 0xA0ABBFFF},      //	PF3 S110
    {0xA0ABC000, 0xA0ABFFFF},      //	PF3 S111
    {0xA0AC0000, 0xA0AC3FFF},      //	PF3 S112
    {0xA0AC4000, 0xA0AC7FFF},      //	PF3 S113
    {0xA0AC8000, 0xA0ACBFFF},      //	PF3 S114
    {0xA0ACC000, 0xA0ACFFFF},      //	PF3 S115
    {0xA0AD0000, 0xA0AD3FFF},      //	PF3 S116
    {0xA0AD4000, 0xA0AD7FFF},      //	PF3 S117
    {0xA0AD8000, 0xA0ADBFFF},      //	PF3 S118
    {0xA0ADC000, 0xA0ADFFFF},      //	PF3 S119
    {0xA0AE0000, 0xA0AE3FFF},      //	PF3 S120
    {0xA0AE4000, 0xA0AE7FFF},      //	PF3 S121
    {0xA0AE8000, 0xA0AEBFFF},      //	PF3 S122
    {0xA0AEC000, 0xA0AEFFFF},      //	PF3 S123
    {0xA0AF0000, 0xA0AF3FFF},      //	PF3 S124
    {0xA0AF4000, 0xA0AF7FFF},      //	PF3 S125
    {0xA0AF8000, 0xA0AFBFFF},      //	PF3 S126
    {0xA0AFC000, 0xA0AFFFFF},      //	PF3 S127
    {0xA0B00000, 0xA0B03FFF},      //	PF3 S128
    {0xA0B04000, 0xA0B07FFF},      //	PF3 S129
    {0xA0B08000, 0xA0B0BFFF},      //	PF3 S130
    {0xA0B0C000, 0xA0B0FFFF},      //	PF3 S131
    {0xA0B10000, 0xA0B13FFF},      //	PF3 S132
    {0xA0B14000, 0xA0B17FFF},      //	PF3 S133
    {0xA0B18000, 0xA0B1BFFF},      //	PF3 S134
    {0xA0B1C000, 0xA0B1FFFF},      //	PF3 S135
    {0xA0B20000, 0xA0B23FFF},      //	PF3 S136
    {0xA0B24000, 0xA0B27FFF},      //	PF3 S137
    {0xA0B28000, 0xA0B2BFFF},      //	PF3 S138
    {0xA0B2C000, 0xA0B2FFFF},      //	PF3 S139
    {0xA0B30000, 0xA0B33FFF},      //	PF3 S140
    {0xA0B34000, 0xA0B37FFF},      //	PF3 S141
    {0xA0B38000, 0xA0B3BFFF},      //	PF3 S142
    {0xA0B3C000, 0xA0B3FFFF},      //	PF3 S143
    {0xA0B40000, 0xA0B43FFF},      //	PF3 S144
    {0xA0B44000, 0xA0B47FFF},      //	PF3 S145
    {0xA0B48000, 0xA0B4BFFF},      //	PF3 S146
    {0xA0B4C000, 0xA0B4FFFF},      //	PF3 S147
    {0xA0B50000, 0xA0B53FFF},      //	PF3 S148
    {0xA0B54000, 0xA0B57FFF},      //	PF3 S149
    {0xA0B58000, 0xA0B5BFFF},      //	PF3 S150
    {0xA0B5C000, 0xA0B5FFFF},      //	PF3 S151
    {0xA0B60000, 0xA0B63FFF},      //	PF3 S152
    {0xA0B64000, 0xA0B67FFF},      //	PF3 S153
    {0xA0B68000, 0xA0B6BFFF},      //	PF3 S154
    {0xA0B6C000, 0xA0B6FFFF},      //	PF3 S155
    {0xA0B70000, 0xA0B73FFF},      //	PF3 S156
    {0xA0B74000, 0xA0B77FFF},      //	PF3 S157
    {0xA0B78000, 0xA0B7BFFF},      //	PF3 S158
    {0xA0B7C000, 0xA0B7FFFF},      //	PF3 S159
    {0xA0B80000, 0xA0B83FFF},      //	PF3 S160
    {0xA0B84000, 0xA0B87FFF},      //	PF3 S161
    {0xA0B88000, 0xA0B8BFFF},      //	PF3 S162
    {0xA0B8C000, 0xA0B8FFFF},      //	PF3 S163
    {0xA0B90000, 0xA0B93FFF},      //	PF3 S164
    {0xA0B94000, 0xA0B97FFF},      //	PF3 S165
    {0xA0B98000, 0xA0B9BFFF},      //	PF3 S166
    {0xA0B9C000, 0xA0B9FFFF},      //	PF3 S167
    {0xA0BA0000, 0xA0BA3FFF},      //	PF3 S168
    {0xA0BA4000, 0xA0BA7FFF},      //	PF3 S169
    {0xA0BA8000, 0xA0BABFFF},      //	PF3 S170
    {0xA0BAC000, 0xA0BAFFFF},      //	PF3 S171
    {0xA0BB0000, 0xA0BB3FFF},      //	PF3 S172
    {0xA0BB4000, 0xA0BB7FFF},      //	PF3 S173
    {0xA0BB8000, 0xA0BBBFFF},      //	PF3 S174
    {0xA0BBC000, 0xA0BBFFFF},      //	PF3 S175
    {0xA0BC0000, 0xA0BC3FFF},      //	PF3 S176
    {0xA0BC4000, 0xA0BC7FFF},      //	PF3 S177
    {0xA0BC8000, 0xA0BCBFFF},      //	PF3 S178
    {0xA0BCC000, 0xA0BCFFFF},      //	PF3 S179
    {0xA0BD0000, 0xA0BD3FFF},      //	PF3 S180
    {0xA0BD4000, 0xA0BD7FFF},      //	PF3 S181
    {0xA0BD8000, 0xA0BDBFFF},      //	PF3 S182
    {0xA0BDC000, 0xA0BDFFFF},      //	PF3 S183
    {0xA0BE0000, 0xA0BE3FFF},      //	PF3 S184
    {0xA0BE4000, 0xA0BE7FFF},      //	PF3 S185
    {0xA0BE8000, 0xA0BEBFFF},      //	PF3 S186
    {0xA0BEC000, 0xA0BEFFFF},      //	PF3 S187
    {0xA0BF0000, 0xA0BF3FFF},      //	PF3 S188
    {0xA0BF4000, 0xA0BF7FFF},      //	PF3 S189
    {0xA0BF8000, 0xA0BFBFFF},      //	PF3 S190
    {0xA0BFC000, 0xA0BFFFFF},      //	PF3 S191
    {0xA0C00000, 0xA0C03FFF},      //	PF4 S0
    {0xA0C04000, 0xA0C07FFF},      //	PF4 S1
    {0xA0C08000, 0xA0C0BFFF},      //	PF4 S2
    {0xA0C0C000, 0xA0C0FFFF},      //	PF4 S3
    {0xA0C10000, 0xA0C13FFF},      //	PF4 S4
    {0xA0C14000, 0xA0C17FFF},      //	PF4 S5
    {0xA0C18000, 0xA0C1BFFF},      //	PF4 S6
    {0xA0C1C000, 0xA0C1FFFF},      //	PF4 S7
    {0xA0C20000, 0xA0C23FFF},      //	PF4 S8
    {0xA0C24000, 0xA0C27FFF},      //	PF4 S9
    {0xA0C28000, 0xA0C2BFFF},      //	PF4 S10
    {0xA0C2C000, 0xA0C2FFFF},      //	PF4 S11
    {0xA0C30000, 0xA0C33FFF},      //	PF4 S12
    {0xA0C34000, 0xA0C37FFF},      //	PF4 S13
    {0xA0C38000, 0xA0C3BFFF},      //	PF4 S14
    {0xA0C3C000, 0xA0C3FFFF},      //	PF4 S15
    {0xA0C40000, 0xA0C43FFF},      //	PF4 S16
    {0xA0C44000, 0xA0C47FFF},      //	PF4 S17
    {0xA0C48000, 0xA0C4BFFF},      //	PF4 S18
    {0xA0C4C000, 0xA0C4FFFF},      //	PF4 S19
    {0xA0C50000, 0xA0C53FFF},      //	PF4 S20
    {0xA0C54000, 0xA0C57FFF},      //	PF4 S21
    {0xA0C58000, 0xA0C5BFFF},      //	PF4 S22
    {0xA0C5C000, 0xA0C5FFFF},      //	PF4 S23
    {0xA0C60000, 0xA0C63FFF},      //	PF4 S24
    {0xA0C64000, 0xA0C67FFF},      //	PF4 S25
    {0xA0C68000, 0xA0C6BFFF},      //	PF4 S26
    {0xA0C6C000, 0xA0C6FFFF},      //	PF4 S27
    {0xA0C70000, 0xA0C73FFF},      //	PF4 S28
    {0xA0C74000, 0xA0C77FFF},      //	PF4 S29
    {0xA0C78000, 0xA0C7BFFF},      //	PF4 S30
    {0xA0C7C000, 0xA0C7FFFF},      //	PF4 S31
    {0xA0C80000, 0xA0C83FFF},      //	PF4 S32
    {0xA0C84000, 0xA0C87FFF},      //	PF4 S33
    {0xA0C88000, 0xA0C8BFFF},      //	PF4 S34
    {0xA0C8C000, 0xA0C8FFFF},      //	PF4 S35
    {0xA0C90000, 0xA0C93FFF},      //	PF4 S36
    {0xA0C94000, 0xA0C97FFF},      //	PF4 S37
    {0xA0C98000, 0xA0C9BFFF},      //	PF4 S38
    {0xA0C9C000, 0xA0C9FFFF},      //	PF4 S39
    {0xA0CA0000, 0xA0CA3FFF},      //	PF4 S40
    {0xA0CA4000, 0xA0CA7FFF},      //	PF4 S41
    {0xA0CA8000, 0xA0CABFFF},      //	PF4 S42
    {0xA0CAC000, 0xA0CAFFFF},      //	PF4 S43
    {0xA0CB0000, 0xA0CB3FFF},      //	PF4 S44
    {0xA0CB4000, 0xA0CB7FFF},      //	PF4 S45
    {0xA0CB8000, 0xA0CBBFFF},      //	PF4 S46
    {0xA0CBC000, 0xA0CBFFFF},      //	PF4 S47
    {0xA0CC0000, 0xA0CC3FFF},      //	PF4 S48
    {0xA0CC4000, 0xA0CC7FFF},      //	PF4 S49
    {0xA0CC8000, 0xA0CCBFFF},      //	PF4 S50
    {0xA0CCC000, 0xA0CCFFFF},      //	PF4 S51
    {0xA0CD0000, 0xA0CD3FFF},      //	PF4 S52
    {0xA0CD4000, 0xA0CD7FFF},      //	PF4 S53
    {0xA0CD8000, 0xA0CDBFFF},      //	PF4 S54
    {0xA0CDC000, 0xA0CDFFFF},      //	PF4 S55
    {0xA0CE0000, 0xA0CE3FFF},      //	PF4 S56
    {0xA0CE4000, 0xA0CE7FFF},      //	PF4 S57
    {0xA0CE8000, 0xA0CEBFFF},      //	PF4 S58
    {0xA0CEC000, 0xA0CEFFFF},      //	PF4 S59
    {0xA0CF0000, 0xA0CF3FFF},      //	PF4 S60
    {0xA0CF4000, 0xA0CF7FFF},      //	PF4 S61
    {0xA0CF8000, 0xA0CFBFFF},      //	PF4 S62
    {0xA0CFC000, 0xA0CFFFFF},      //	PF4 S63
    {0xA0D00000, 0xA0D03FFF},      //	PF4 S64
    {0xA0D04000, 0xA0D07FFF},      //	PF4 S65
    {0xA0D08000, 0xA0D0BFFF},      //	PF4 S66
    {0xA0D0C000, 0xA0D0FFFF},      //	PF4 S67
    {0xA0D10000, 0xA0D13FFF},      //	PF4 S68
    {0xA0D14000, 0xA0D17FFF},      //	PF4 S69
    {0xA0D18000, 0xA0D1BFFF},      //	PF4 S70
    {0xA0D1C000, 0xA0D1FFFF},      //	PF4 S71
    {0xA0D20000, 0xA0D23FFF},      //	PF4 S72
    {0xA0D24000, 0xA0D27FFF},      //	PF4 S73
    {0xA0D28000, 0xA0D2BFFF},      //	PF4 S74
    {0xA0D2C000, 0xA0D2FFFF},      //	PF4 S75
    {0xA0D30000, 0xA0D33FFF},      //	PF4 S76
    {0xA0D34000, 0xA0D37FFF},      //	PF4 S77
    {0xA0D38000, 0xA0D3BFFF},      //	PF4 S78
    {0xA0D3C000, 0xA0D3FFFF},      //	PF4 S79
    {0xA0D40000, 0xA0D43FFF},      //	PF4 S80
    {0xA0D44000, 0xA0D47FFF},      //	PF4 S81
    {0xA0D48000, 0xA0D4BFFF},      //	PF4 S82
    {0xA0D4C000, 0xA0D4FFFF},      //	PF4 S83
    {0xA0D50000, 0xA0D53FFF},      //	PF4 S84
    {0xA0D54000, 0xA0D57FFF},      //	PF4 S85
    {0xA0D58000, 0xA0D5BFFF},      //	PF4 S86
    {0xA0D5C000, 0xA0D5FFFF},      //	PF4 S87
    {0xA0D60000, 0xA0D63FFF},      //	PF4 S88
    {0xA0D64000, 0xA0D67FFF},      //	PF4 S89
    {0xA0D68000, 0xA0D6BFFF},      //	PF4 S90
    {0xA0D6C000, 0xA0D6FFFF},      //	PF4 S91
    {0xA0D70000, 0xA0D73FFF},      //	PF4 S92
    {0xA0D74000, 0xA0D77FFF},      //	PF4 S93
    {0xA0D78000, 0xA0D7BFFF},      //	PF4 S94
    {0xA0D7C000, 0xA0D7FFFF},      //	PF4 S95
    {0xA0D80000, 0xA0D83FFF},      //	PF4 S96
    {0xA0D84000, 0xA0D87FFF},      //	PF4 S97
    {0xA0D88000, 0xA0D8BFFF},      //	PF4 S98
    {0xA0D8C000, 0xA0D8FFFF},      //	PF4 S99
    {0xA0D90000, 0xA0D93FFF},      //	PF4 S100
    {0xA0D94000, 0xA0D97FFF},      //	PF4 S101
    {0xA0D98000, 0xA0D9BFFF},      //	PF4 S102
    {0xA0D9C000, 0xA0D9FFFF},      //	PF4 S103
    {0xA0DA0000, 0xA0DA3FFF},      //	PF4 S104
    {0xA0DA4000, 0xA0DA7FFF},      //	PF4 S105
    {0xA0DA8000, 0xA0DABFFF},      //	PF4 S106
    {0xA0DAC000, 0xA0DAFFFF},      //	PF4 S107
    {0xA0DB0000, 0xA0DB3FFF},      //	PF4 S108
    {0xA0DB4000, 0xA0DB7FFF},      //	PF4 S109
    {0xA0DB8000, 0xA0DBBFFF},      //	PF4 S110
    {0xA0DBC000, 0xA0DBFFFF},      //	PF4 S111
    {0xA0DC0000, 0xA0DC3FFF},      //	PF4 S112
    {0xA0DC4000, 0xA0DC7FFF},      //	PF4 S113
    {0xA0DC8000, 0xA0DCBFFF},      //	PF4 S114
    {0xA0DCC000, 0xA0DCFFFF},      //	PF4 S115
    {0xA0DD0000, 0xA0DD3FFF},      //	PF4 S116
    {0xA0DD4000, 0xA0DD7FFF},      //	PF4 S117
    {0xA0DD8000, 0xA0DDBFFF},      //	PF4 S118
    {0xA0DDC000, 0xA0DDFFFF},      //	PF4 S119
    {0xA0DE0000, 0xA0DE3FFF},      //	PF4 S120
    {0xA0DE4000, 0xA0DE7FFF},      //	PF4 S121
    {0xA0DE8000, 0xA0DEBFFF},      //	PF4 S122
    {0xA0DEC000, 0xA0DEFFFF},      //	PF4 S123
    {0xA0DF0000, 0xA0DF3FFF},      //	PF4 S124
    {0xA0DF4000, 0xA0DF7FFF},      //	PF4 S125
    {0xA0DF8000, 0xA0DFBFFF},      //	PF4 S126
    {0xA0DFC000, 0xA0DFFFFF},      //	PF4 S127
    {0xA0E00000, 0xA0E03FFF},      //	PF4 S128
    {0xA0E04000, 0xA0E07FFF},      //	PF4 S129
    {0xA0E08000, 0xA0E0BFFF},      //	PF4 S130
    {0xA0E0C000, 0xA0E0FFFF},      //	PF4 S131
    {0xA0E10000, 0xA0E13FFF},      //	PF4 S132
    {0xA0E14000, 0xA0E17FFF},      //	PF4 S133
    {0xA0E18000, 0xA0E1BFFF},      //	PF4 S134
    {0xA0E1C000, 0xA0E1FFFF},      //	PF4 S135
    {0xA0E20000, 0xA0E23FFF},      //	PF4 S136
    {0xA0E24000, 0xA0E27FFF},      //	PF4 S137
    {0xA0E28000, 0xA0E2BFFF},      //	PF4 S138
    {0xA0E2C000, 0xA0E2FFFF},      //	PF4 S139
    {0xA0E30000, 0xA0E33FFF},      //	PF4 S140
    {0xA0E34000, 0xA0E37FFF},      //	PF4 S141
    {0xA0E38000, 0xA0E3BFFF},      //	PF4 S142
    {0xA0E3C000, 0xA0E3FFFF},      //	PF4 S143
    {0xA0E40000, 0xA0E43FFF},      //	PF4 S144
    {0xA0E44000, 0xA0E47FFF},      //	PF4 S145
    {0xA0E48000, 0xA0E4BFFF},      //	PF4 S146
    {0xA0E4C000, 0xA0E4FFFF},      //	PF4 S147
    {0xA0E50000, 0xA0E53FFF},      //	PF4 S148
    {0xA0E54000, 0xA0E57FFF},      //	PF4 S149
    {0xA0E58000, 0xA0E5BFFF},      //	PF4 S150
    {0xA0E5C000, 0xA0E5FFFF},      //	PF4 S151
    {0xA0E60000, 0xA0E63FFF},      //	PF4 S152
    {0xA0E64000, 0xA0E67FFF},      //	PF4 S153
    {0xA0E68000, 0xA0E6BFFF},      //	PF4 S154
    {0xA0E6C000, 0xA0E6FFFF},      //	PF4 S155
    {0xA0E70000, 0xA0E73FFF},      //	PF4 S156
    {0xA0E74000, 0xA0E77FFF},      //	PF4 S157
    {0xA0E78000, 0xA0E7BFFF},      //	PF4 S158
    {0xA0E7C000, 0xA0E7FFFF},      //	PF4 S159
    {0xA0E80000, 0xA0E83FFF},      //	PF4 S160
    {0xA0E84000, 0xA0E87FFF},      //	PF4 S161
    {0xA0E88000, 0xA0E8BFFF},      //	PF4 S162
    {0xA0E8C000, 0xA0E8FFFF},      //	PF4 S163
    {0xA0E90000, 0xA0E93FFF},      //	PF4 S164
    {0xA0E94000, 0xA0E97FFF},      //	PF4 S165
    {0xA0E98000, 0xA0E9BFFF},      //	PF4 S166
    {0xA0E9C000, 0xA0E9FFFF},      //	PF4 S167
    {0xA0EA0000, 0xA0EA3FFF},      //	PF4 S168
    {0xA0EA4000, 0xA0EA7FFF},      //	PF4 S169
    {0xA0EA8000, 0xA0EABFFF},      //	PF4 S170
    {0xA0EAC000, 0xA0EAFFFF},      //	PF4 S171
    {0xA0EB0000, 0xA0EB3FFF},      //	PF4 S172
    {0xA0EB4000, 0xA0EB7FFF},      //	PF4 S173
    {0xA0EB8000, 0xA0EBBFFF},      //	PF4 S174
    {0xA0EBC000, 0xA0EBFFFF},      //	PF4 S175
    {0xA0EC0000, 0xA0EC3FFF},      //	PF4 S176
    {0xA0EC4000, 0xA0EC7FFF},      //	PF4 S177
    {0xA0EC8000, 0xA0ECBFFF},      //	PF4 S178
    {0xA0ECC000, 0xA0ECFFFF},      //	PF4 S179
    {0xA0ED0000, 0xA0ED3FFF},      //	PF4 S180
    {0xA0ED4000, 0xA0ED7FFF},      //	PF4 S181
    {0xA0ED8000, 0xA0EDBFFF},      //	PF4 S182
    {0xA0EDC000, 0xA0EDFFFF},      //	PF4 S183
    {0xA0EE0000, 0xA0EE3FFF},      //	PF4 S184
    {0xA0EE4000, 0xA0EE7FFF},      //	PF4 S185
    {0xA0EE8000, 0xA0EEBFFF},      //	PF4 S186
    {0xA0EEC000, 0xA0EEFFFF},      //	PF4 S187
    {0xA0EF0000, 0xA0EF3FFF},      //	PF4 S188
    {0xA0EF4000, 0xA0EF7FFF},      //	PF4 S189
    {0xA0EF8000, 0xA0EFBFFF},      //	PF4 S190
    {0xA0EFC000, 0xA0EFFFFF},      //	PF4 S191
    {0xA0F00000, 0xA0F03FFF},      //	PF5 S0
    {0xA0F04000, 0xA0F07FFF},      //	PF5 S1
    {0xA0F08000, 0xA0F0BFFF},      //	PF5 S2
    {0xA0F0C000, 0xA0F0FFFF},      //	PF5 S3
    {0xA0F10000, 0xA0F13FFF},      //	PF5 S4
    {0xA0F14000, 0xA0F17FFF},      //	PF5 S5
    {0xA0F18000, 0xA0F1BFFF},      //	PF5 S6
    {0xA0F1C000, 0xA0F1FFFF},      //	PF5 S7
    {0xA0F20000, 0xA0F23FFF},      //	PF5 S8
    {0xA0F24000, 0xA0F27FFF},      //	PF5 S9
    {0xA0F28000, 0xA0F2BFFF},      //	PF5 S10
    {0xA0F2C000, 0xA0F2FFFF},      //	PF5 S11
    {0xA0F30000, 0xA0F33FFF},      //	PF5 S12
    {0xA0F34000, 0xA0F37FFF},      //	PF5 S13
    {0xA0F38000, 0xA0F3BFFF},      //	PF5 S14
    {0xA0F3C000, 0xA0F3FFFF},      //	PF5 S15
    {0xA0F40000, 0xA0F43FFF},      //	PF5 S16
    {0xA0F44000, 0xA0F47FFF},      //	PF5 S17
    {0xA0F48000, 0xA0F4BFFF},      //	PF5 S18
    {0xA0F4C000, 0xA0F4FFFF},      //	PF5 S19
    {0xA0F50000, 0xA0F53FFF},      //	PF5 S20
    {0xA0F54000, 0xA0F57FFF},      //	PF5 S21
    {0xA0F58000, 0xA0F5BFFF},      //	PF5 S22
    {0xA0F5C000, 0xA0F5FFFF},      //	PF5 S23
    {0xA0F60000, 0xA0F63FFF},      //	PF5 S24
    {0xA0F64000, 0xA0F67FFF},      //	PF5 S25
    {0xA0F68000, 0xA0F6BFFF},      //	PF5 S26
    {0xA0F6C000, 0xA0F6FFFF},      //	PF5 S27
    {0xA0F70000, 0xA0F73FFF},      //	PF5 S28
    {0xA0F74000, 0xA0F77FFF},      //	PF5 S29
    {0xA0F78000, 0xA0F7BFFF},      //	PF5 S30
    {0xA0F7C000, 0xA0F7FFFF},      //	PF5 S31
    {0xA0F80000, 0xA0F83FFF},      //	PF5 S32
    {0xA0F84000, 0xA0F87FFF},      //	PF5 S33
    {0xA0F88000, 0xA0F8BFFF},      //	PF5 S34
    {0xA0F8C000, 0xA0F8FFFF},      //	PF5 S35
    {0xA0F90000, 0xA0F93FFF},      //	PF5 S36
    {0xA0F94000, 0xA0F97FFF},      //	PF5 S37
    {0xA0F98000, 0xA0F9BFFF},      //	PF5 S38
    {0xA0F9C000, 0xA0F9FFFF},      //	PF5 S39
    {0xA0FA0000, 0xA0FA3FFF},      //	PF5 S40
    {0xA0FA4000, 0xA0FA7FFF},      //	PF5 S41
    {0xA0FA8000, 0xA0FABFFF},      //	PF5 S42
    {0xA0FAC000, 0xA0FAFFFF},      //	PF5 S43
    {0xA0FB0000, 0xA0FB3FFF},      //	PF5 S44
    {0xA0FB4000, 0xA0FB7FFF},      //	PF5 S45
    {0xA0FB8000, 0xA0FBBFFF},      //	PF5 S46
    {0xA0FBC000, 0xA0FBFFFF},      //	PF5 S47
    {0xA0FC0000, 0xA0FC3FFF},      //	PF5 S48
    {0xA0FC4000, 0xA0FC7FFF},      //	PF5 S49
    {0xA0FC8000, 0xA0FCBFFF},      //	PF5 S50
    {0xA0FCC000, 0xA0FCFFFF},      //	PF5 S51
    {0xA0FD0000, 0xA0FD3FFF},      //	PF5 S52
    {0xA0FD4000, 0xA0FD7FFF},      //	PF5 S53
    {0xA0FD8000, 0xA0FDBFFF},      //	PF5 S54
    {0xA0FDC000, 0xA0FDFFFF},      //	PF5 S55
    {0xA0FE0000, 0xA0FE3FFF},      //	PF5 S56
    {0xA0FE4000, 0xA0FE7FFF},      //	PF5 S57
    {0xA0FE8000, 0xA0FEBFFF},      //	PF5 S58
    {0xA0FEC000, 0xA0FEFFFF},      //	PF5 S59
    {0xA0FF0000, 0xA0FF3FFF},      //	PF5 S60
    {0xA0FF4000, 0xA0FF7FFF},      //	PF5 S61
    {0xA0FF8000, 0xA0FFBFFF},      //	PF5 S62
    {0xA0FFC000, 0xA0FFFFFF},      //	PF5 S63
};

IFX_CONST IfxFlash_flashSector IfxFlash_pFlashTablePhys[IFXFLASH_PFLASH_NUM_PHYSICAL_SECTORS] = {
    {0xA0000000, 0xA00FFFFF},     /* PF0 PS0*/
    {0xA0100000, 0xA01FFFFF},     /* PF0 PS1*/
    {0xA0200000, 0xA02FFFFF},     /* PF0 PS2*/
    {0xA0300000, 0xA03FFFFF},     /* PF1 PS0*/
    {0xA0400000, 0xA04FFFFF},     /* PF1 PS1*/
    {0xA0500000, 0xA05FFFFF},     /* PF1 PS2*/
    {0xA0600000, 0xA06FFFFF},     /* PF2 PS0*/
    {0xA0700000, 0xA07FFFFF},     /* PF2 PS1*/
    {0xA0800000, 0xA08FFFFF},     /* PF2 PS2*/
    {0xA0900000, 0xA09FFFFF},     /* PF3 PS0*/
    {0xA0A00000, 0xA0AFFFFF},     /* PF3 PS1*/
    {0xA0B00000, 0xA0BFFFFF},     /* PF3 PS2*/
    {0xA0C00000, 0xA0CFFFFF},     /* PF4 PS0*/
    {0xA0D00000, 0xA0DFFFFF},     /* PF4 PS1*/
    {0xA0E00000, 0xA0EFFFFF},     /* PF4 PS2*/
    {0xA0F00000, 0xA0FFFFFF},     /* PF5 PS0*/
};
#endif

#if defined (_TASKING_) || defined (_ghs_)
#pragma restore
#endif
